{
  id: "faithful_village",
  name: "A Faithful Village",
  image: "cloudinary/faithful_village/card_image_kbpjsa.png",
  details: "In Faithful Village, You are a god, and like all gods, You crave faith. You turned Your all-seeing\
            gaze to this peaceful village whose inhabitants are a bit stupid, yet You feel they can accomplish\
            great things given the right guidance.",
  page: [
    {
      type: "text",
      title: "A Faithful Village"
    },
    {
      type: "text",
      title: "Ludum Dare 43",
      text: "\
        This is my entry for the Ludum Dare 40 game jam. The theme was \"Sacrifices must be made\".\
        I developed this game alongside 3 friends."
    },
    {
      type: "text",
      title: "Pitch",
      text: "\
        In Faithful Village, You are a god, and like all gods, You crave faith. You turned Your all-seeing\
        gaze to this peaceful village whose inhabitants are a bit stupid, yet You feel they can accomplish\
        great things given the right guidance."
    },
    {
      type: "image",
      src: "cloudinary/faithful_village/big_town_awwctg.png",
      caption: "A developed town"
    },
    {
      type: "text",
      title: "",
      text: "\
        Your goal is to turn this village into a thriving civilization whose kingdom reaches as far as the eye\
        can see. You can order buildings being constructed to provide for Your people’s needs and bring speed\
        to the most faithful ones. But beware that You remain feared, or Your influence will vanish…"
    },
    {
      type: "text",
      title: "The townsfolk",
      text: "\
        There are 5 different types of workers, whose efficiency will grow over time. Farmers harvest and\
        tend crops, while Loggers chop down trees for timber. Builders do Your construction work, and\
        Breeders make sure the town stays populated and lively. Last, but definitely not least, Priests will\
        motivate the townsfolk to provide for their god! However, they do sometimes overestimate their\
        understanding of Your will, and may require unneeded sacrifices. Make sure You are prepared for it!"
    },
    {
      type: "image",
      src: "cloudinary/faithful_village/sacrifice_vhnjil.png",
      caption: "A sacrifice"
    },
    {
      type: "text",
      title: "The town",
      text: "\
        There are 5 types of buildings. Houses shelter Your people during the night, and Warehouses hold\
        their resources. Fields provide food to feed Your growing empire, and Roads helps its expansion.\
        Finally, Temples increases the population’s faith and serves as places of worship."
    },
    {
      type: "text",
      title: "Faith",
      text: "\
        Faith is Your primary resource whose You should never run out of. Sadly, Your people are not immune\
        to doubt and may stop believing in Your all-mightiness. You can make them remember Your mercy by\
        building a Temple, or showing them Your strength by unleashing a vengeful meteor on their puny\
        village."
    },
    {
      type: "image",
      src: "cloudinary/faithful_village/meteor_zqeztm.png",
      caption: "Some meteors"
    },
    {
      type: "text",
      title: "Results",
      text: "\
        The <a href=https://ldjam.com/events/ludum-dare/43/a-faithful-village'>Ludum Dare entry</a> and\
        <a href='http://slimevoid.net/tmp/a-faithful-village.zip'>final release</a> are available."
    }
  ]
}
